import Image from "next/image";
import "./globals.css";
import Upload from "../ui/Components/Upload";

export default function Home() {
  return (
    <div>
      <h1 className="wooridaumL">Hello World적용됨????</h1>
      <p className="wooridaumB">여기에만 적용하고 싶어요</p>
      <Upload />

      <image>sr</image>

      <p>
        모든 국민은 고문을 받지 아니하며, 형사상 자기에게 불리한 진술을
        강요당하지 아니한다. 중앙선거관리위원회는 법령의 범위안에서
        선거관리·국민투표관리 또는 정당사무에 관한 규칙을 제정할 수 있으며,
        법률에 저촉되지 아니하는 범위안에서 내부규율에 관한 규칙을 제정할 수
        있다. 탄핵결정은 공직으로부터 파면함에 그친다. 그러나, 이에 의하여
        민사상이나 형사상의 책임이 면제되지는 아니한다. 의원을 제명하려면
        국회재적의원 3분의 2 이상의 찬성이 있어야 한다. 헌법재판소 재판관의
        임기는 6년으로 하며, 법률이 정하는 바에 의하여 연임할 수 있다. 이
        헌법시행 당시의 대법원장과 대법원판사가 아닌 법관은 제1항 단서의 규정에
        불구하고 이 헌법에 의하여 임명된 것으로 본다. 제1항의 지시를 받은 당해
        행정기관은 이에 응하여야 한다. 국무위원은 국정에 관하여 대통령을
        보좌하며, 국무회의의 구성원으로서 국정을 심의한다. 국회의원은 현행범인인
        경우를 제외하고는 회기중 국회의 동의없이 체포 또는 구금되지 아니한다.
        국가유공자·상이군경 및 전몰군경의 유가족은 법률이 정하는 바에 의하여
        우선적으로 근로의 기회를 부여받는다. 대통령의 선거에 관한 사항은 법률로
        정한다. 대통령후보자가 1인일 때에는 그 득표수가 선거권자 총수의 3분의 1
        이상이 아니면 대통령으로 당선될 수 없다. 신체장애자 및 질병·노령 기타의
        사유로 생활능력이 없는 국민은 법률이 정하는 바에 의하여 국가의 보호를
        받는다. 명령·규칙 또는 처분이 헌법이나 법률에 위반되는 여부가 재판의
        전제가 된 경우에는 대법원은 이를 최종적으로 심사할 권한을 가진다. 정부는
        회계연도마다 예산안을 편성하여 회계연도 개시 90일전까지 국회에 제출하고,
        국회는 회계연도 개시 30일전까지 이를 의결하여야 한다. 국회는 국가의
        예산안을 심의·확정한다. 모든 국민은 능력에 따라 균등하게 교육을 받을
        권리를 가진다. 모든 국민은 보건에 관하여 국가의 보호를 받는다. 국회는
        의원의 자격을 심사하며, 의원을 징계할 수 있다. 선거에 관한 경비는 법률이
        정하는 경우를 제외하고는 정당 또는 후보자에게 부담시킬 수 없다. 이
        헌법중 공무원의 임기 또는 중임제한에 관한 규정은 이 헌법에 의하여 그
        공무원이 최초로 선출 또는 임명된 때로부터 적용한다. 광물 기타 중요한
        지하자원·수산자원·수력과 경제상 이용할 수 있는 자연력은 법률이 정하는
        바에 의하여 일정한 기간 그 채취·개발 또는 이용을 특허할 수 있다. 모든
        국민은 헌법과 법률이 정한 법관에 의하여 법률에 의한 재판을 받을 권리를
        가진다. 대한민국의 주권은 국민에게 있고, 모든 권력은 국민으로부터
        나온다. 모든 국민은 법률이 정하는 바에 의하여 선거권을 가진다. 모든
        국민은 주거의 자유를 침해받지 아니한다. 주거에 대한 압수나 수색을 할
        때에는 검사의 신청에 의하여 법관이 발부한 영장을 제시하여야 한다.
        근로자는 근로조건의 향상을 위하여 자주적인 단결권·단체교섭권 및
        단체행동권을 가진다. 학교교육 및 평생교육을 포함한 교육제도와 그 운영,
        교육재정 및 교원의 지위에 관한 기본적인 사항은 법률로 정한다. 대법원은
        법률에 저촉되지 아니하는 범위안에서 소송에 관한 절차, 법원의 내부규율과
        사무처리에 관한 규칙을 제정할 수 있다. 군인은 현역을 면한 후가 아니면
        국무위원으로 임명될 수 없다. 모든 국민은 사생활의 비밀과 자유를 침해받지
        아니한다. 대통령의 임기가 만료되는 때에는 임기만료 70일 내지 40일전에
        후임자를 선거한다. 국군은 국가의 안전보장과 국토방위의 신성한 의무를
        수행함을 사명으로 하며, 그 정치적 중립성은 준수된다. 국회의 정기회는
        법률이 정하는 바에 의하여 매년 1회 집회되며, 국회의 임시회는 대통령 또는
        국회재적의원 4분의 1 이상의 요구에 의하여 집회된다. 국가는 여자의 복지와
        권익의 향상을 위하여 노력하여야 한다. 감사원은 세입·세출의 결산을 매년
        검사하여 대통령과 차년도국회에 그 결과를 보고하여야 한다. 국회의원은
        법률이 정하는 직을 겸할 수 없다. 모든 국민은 법률이 정하는 바에 의하여
        공무담임권을 가진다. 국가는 주택개발정책등을 통하여 모든 국민이 쾌적한
        주거생활을 할 수 있도록 노력하여야 한다. 정당은 그 목적·조직과 활동이
        민주적이어야 하며, 국민의 정치적 의사형성에 참여하는데 필요한 조직을
        가져야 한다. 국회는 법률에 저촉되지 아니하는 범위안에서 의사와
        내부규율에 관한 규칙을 제정할 수 있다. 위원은 탄핵 또는 금고 이상의 형의
        선고에 의하지 아니하고는 파면되지 아니한다. 제3항의 승인을 얻지 못한
        때에는 그 처분 또는 명령은 그때부터 효력을 상실한다. 이 경우 그 명령에
        의하여 개정 또는 폐지되었던 법률은 그 명령이 승인을 얻지 못한 때부터
        당연히 효력을 회복한다. Powered by AngularJS & Bootstrap
      </p>
      <nav>네비게이션 바</nav>
    </div>
  );
}
